In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [12]:
dframe = DataFrame({'City':['Alma','Brian Head','Fox Park'],
                     'altitude':[3158,3000,2762]})

In [13]:
dframe

         City  altitude
0        Alma      3158
1  Brian Head      3000
2    Fox Park      2762

In [14]:
state_map = {'Alma':'Colorada','Brian Head':'Utah','Fox Park':'Wyoming'}

In [15]:
dframe['state'] = dframe['City'].map(state_map)

In [16]:
dframe

         City  altitude     state
0        Alma      3158  Colorada
1  Brian Head      3000      Utah
2    Fox Park      2762   Wyoming